src/Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <comment>(Общ)</comment>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НоменклатурныеГруппы</owners>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждатьОНецелыхМестах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержитЕХО</name>
    <comment>Содержит единиц хранения остатков (используется для логистики)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/КлассификаторЕдиницИзмерения/КлассификаторЕдиницИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторЕдиницИзмерения</name>
  <comment>(Общ)</comment>
  <predefined>
    <items>
      <name>Коробка</name>
      <description>Коробка</description>
    </items>
    <items>
      <name>Паллета</name>
      <description>Паллета</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ЕдиницыИзмерения/ObjectModule.bsl
// Обработчик события ПередЗаписью .
//
Процедура ПередЗаписью(Отказ)

	Если НЕ ОбменДанными.Загрузка
		И ТипЗнч(Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		Если ЕдиницаПоКлассификатору = Справочники.КлассификаторЕдиницИзмерения.Паллета ИЛИ ЕдиницаПоКлассификатору = Справочники.КлассификаторЕдиницИзмерения.Коробка Тогда
			Если НЕ РольДоступна("УправлениеСкладскойЛогистикой") Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для редактирования единицы """ + Наименование + """!", Отказ);
			КонецЕсли;
		Иначе
			Если НЕ РольДоступна("РедактированиеНоменклатуры") И НЕ ЗначениеЗаполнено(ЕдиницаПоКлассификатору) Тогда
				Отказ = Истина;
				ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для редактирования единицы """ + Наименование + """ без установки соответствия по классификатору!", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если Владелец.ЕдиницаХраненияОстатков = Ссылка Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ТекущийЭлемент", ЭтотОбъект.Ссылка);
			
			Запрос.Текст =
			"ВЫБРАТЬ
			| ЕдиницыИзмерения.Ссылка КАК Элемент,
			| ЕдиницыИзмерения.Коэффициент КАК Коэффициент
			|ИЗ
			| Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
			|
			|ГДЕ
			| ЕдиницыИзмерения.Ссылка = &ТекущийЭлемент";
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
			//Если Выборка.Следующий()
				//И СокрЛП(глЗначениеПеременной("глТекущийПользователь")) <> "Федоровская Анна" Тогда
				//И СокрЛП(глЗначениеПеременной("глТекущийПользователь")) <> "Смартис" Тогда
				Если Выборка.Коэффициент <> Коэффициент Тогда
					Если ПолныеПрава.Номенклатура_СуществуютСсылки(Владелец, Неопределено) Тогда
						ОбщегоНазначения.СообщитьОбОшибке("Единица """ + Наименование + """ является единицей хранения остатков для """ + Владелец.Наименование + """ и уже участвует в товародвижении. Изменить коэффициент уже нельзя!", Отказ);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Не ОбменДанными.Загрузка
		И Не Отказ
		И Коэффициент = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Для "+СокрЛП(Владелец)+" у единицы измерения "+СокрЛП(Ссылка)+" не задан коэффициент! Он будет установлен равным 1.");
		Коэффициент = 1;
	КонецЕсли;

КонецПроцедуры // ПередЗаписью()
